app/controllers/agents_controller.rb

SELECT * FROM `agents` WHERE (name LIKE '%%')
---
  def index
    #if params[:search]
      @agents = Agent.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])