app/controllers/cards_controller.rb

  def index
      @cards = Card.all
---
SELECT * FROM `cards`

   def create

    @card = Card.new
    @card.status = params[:card][:status]
    @card.message_id = params[:card][:message_id]

    if @card.save
---
INSERT INTO `cards` (`status`, `message_id`, `file_id`, `updated_at`, `farwarded_id`, `created_at`) VALUES(NULL, NULL, NULL, '2010-07-30 03:09:14', NULL, '2010-07-30 03:09:14')