app/controllers/claims_controller.rb

SELECT * FROM `claims`
---
  def index
    @claims = Claim.all

INSERT INTO `claims` (`updated_at`, `destination`, `subject`, `created_at`) VALUES('2010-07-30 03:09:14', NULL, NULL, '2010-07-30 03:09:14')
---
  def create
    @claim = Claim.new(params[:claim])

    respond_to do |format|
      if @claim.save