app/controllers/commendants_controller.rb

SELECT * FROM `commendants`
---
  def index
    @commendants = Commendant.all

INSERT INTO `commendants` (`name`, `updated_at`, `cell`, `org_id`, `phone`, `created_at`) VALUES(NULL, '2010-07-30 03:09:14', NULL, NULL, NULL, '2010-07-30 03:09:14')
---
  def create
    @commendant = Commendant.new(params[:commendant])

    respond_to do |format|
      if @commendant.save