app/controllers/messages_controller.rb

SELECT * FROM `messages` ORDER BY obtain_at desc
---
    @search = search
    (/\! .*/.match(exp)).to_s[2..-1] ? search = "= '#{(/\! .*/.match(exp)).to_s[2..-1]}'" : search = "LIKE '%#{exp}%'"

    @years = Message.first.created_at.year..Message.last.created_at.year