app/controllers/orders_controller.rb

SELECT * FROM `orders` ORDER BY id desc
---
  def index
    @orders = Order.all(:order => "number desc")