app/controllers/orgs_controller.rb

  def index
    @orgs = Org.all
---
SELECT * FROM `orgs`

  def create
    @org = Org.new(params[:org])

    respond_to do |format|
      if @org.save
---
INSERT INTO `orgs` (`name`, `updated_at`, `commendant_id`, `address`, `created_at`) VALUES(NULL, '2010-07-30 03:09:16', NULL, NULL, '2010-07-30 03:09:16')